kuoliu242321/plant_detection/stm32/Drivers/SYSTEM/usart/usart.c
#include "./SYSTEM/sys/sys.h"
#include "./SYSTEM/usart/usart.h"
#include "FreeRTOS.h"
#include "queue.h"

//extern QueueHandle_t xQueueIRQcmd;

/* 如果使用os,则包括下面的头文件即可. */
/******************************************************************************************/
/* 加入以下代码, 支持printf函数, 而不需要选择use MicroLIB */

#if 1

#if (__ARMCC_VERSION >= 6010050)            /* 使用AC6编译器时 */
__asm(".global __use_no_semihosting\n\t");  /* 声明不使用半主机模式 */
__asm(".global __ARM_use_no_argv \n\t");    /* AC6下需要声明main函数为无参数格式，否则部分例程可能出现半主机模式 */

#else
/* 使用AC5编译器时, 要在这里定义__FILE 和 不使用半主机模式 */
#pragma import(__use_no_semihosting)

struct __FILE
{
    int handle;
    /* Whatever you require here. If the only file you are using is */
    /* standard output using printf() for debugging, no file handling */
    /* is required. */
};

#endif

/* 不使用半主机模式，至少需要重定义_ttywrch\_sys_exit\_sys_command_string函数,以同时兼容AC6和AC5模式 */
int _ttywrch(int ch)
{
    ch = ch;
    return ch;
}

/* 定义_sys_exit()以避免使用半主机模式 */
void _sys_exit(int x)
{
    x = x;
}

char *_sys_command_string(char *cmd, int len)
{
    return NULL;
}


/* FILE 在 stdio.h里面定义. */
FILE __stdout;

/* MDK下需要重定义fputc函数, printf函数最终会通过调用fputc输出字符串到串口 */
int fputc(int ch, FILE *f)
{
//////////////////////////////////////////////////////////////////////////////////////   
#if USART_EN_RX /*如果使能了接收*/
    {
    while ((USART_UX->SR & 0X40) == 0);     /* 等待上一个字符发送完成 */

    USART_UX->DR = (uint8_t)ch;             /* 将要发送的字符 ch 写入到DR寄存器 */
    return ch;
    }
#endif
////////////////////////////////////////////////////////////////////////////////////////
//#if USART2_EN_RX /*如果使能了接收*/
//    {
//    while ((USART2_UX->SR & 0X40) == 0);     /* 等待上一个字符发送完成 */

//    USART2_UX->DR = (uint8_t)ch;             /* 将要发送的字符 ch 写入到DR寄存器 */
//    //return ch;
//    }
//#endif
////////////////////////////////////////////////////////////////////////////////////////
//#if USART3_EN_RX /*如果使能了接收*/
//    {
//    while ((USART3_UX->SR & 0X40) == 0);     /* 等待上一个字符发送完成 */

//    USART3_UX->DR = (uint8_t)ch;             /* 将要发送的字符 ch 写入到DR寄存器 */
//    return ch;
//    }
//#endif
////////////////////////////////////////////////////////////////////////////////////////
//    
}
#endif
/******************************************************************************************/

char IntermediateBuffer[USART_REC_LEN];//中介字符组

/////////////////////////////////////////////////////////////////////////////////////
//#if USART_EN_RX /*如果使能了接收*/

/* 接收缓冲, 最大USART_REC_LEN个字节. */
char g_usart_rx_buf[USART_REC_LEN];

uint16_t g_usart_rx_sta = 0;

uint8_t g_rx_buffer[RXBUFFERSIZE];  /* HAL库使用的串口接收缓冲 */

UART_HandleTypeDef g_uart1_handle;  /* UART句柄 */

/////////////////////////////////////////////////////////////////////////////////////
//#if USART2_EN_RX /*如果使能了接收*/
 
/* 接收缓冲, 最大USART_REC_LEN个字节. */
char g_usart_rx_buf2[USART2_REC_LEN];

uint16_t g_usart_rx_sta2 = 0;

uint8_t g_rx_buffer2[RXBUFFERSIZE_2];  /* HAL库使用的串口接收缓冲 */

UART_HandleTypeDef g_uart2_handle;  /* UART句柄 */
/////////////////////////////////////////////////////////////////////////////////////
//#if USART3_EN_RX /*如果使能了接收*/

/* 接收缓冲, 最大USART_REC_LEN个字节. */
char g_usart_rx_buf3[USART3_REC_LEN];

uint16_t g_usart_rx_sta3 = 0;

uint8_t g_rx_buffer3[RXBUFFERSIZE_3];  /* HAL库使用的串口接收缓冲 */

UART_HandleTypeDef g_uart3_handle;  /* UART句柄 */

/////////////////////////////////////////////////////////////////////////////////////




/**
 * @brief       串口数据接收回调函数
                数据处理在这里进行
 * @param       huart:串口句柄
 * @retval      无
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
//usaart1    
    if (huart->Instance == USART_UX)                    /* 如果是串口1 */
    {
        if ((g_usart_rx_sta & 0x8000) == 0)             /* 接收未完成 */
        {
            if (g_usart_rx_sta & 0x4000)                /* 接收到了0x0d（即回车键） */
            {
                if (g_rx_buffer[0] != 0x0a)             /* 接收到的不是0x0a（即不是换行键） */
                {
                    g_usart_rx_sta = 0;                 /* 接收错误,重新开始 */
                }
                else                                    /* 接收到的是0x0a（即换行键） */
                {
                    g_usart_rx_sta |= 0x8000;           /* 接收完成了 */
                }
            }
            else                                        /* 还没收到0X0d（即回车键） */
            {
                if (g_rx_buffer[0] == 0x0d)
                    g_usart_rx_sta |= 0x4000;
                else
                {
                    g_usart_rx_buf[g_usart_rx_sta & 0X3FFF] = g_rx_buffer[0];
                    g_usart_rx_sta++;

                    if (g_usart_rx_sta > (USART_REC_LEN - 1))
                    {
                        g_usart_rx_sta = 0;             /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }

        HAL_UART_Receive_IT(&g_uart1_handle, (uint8_t *)g_rx_buffer, RXBUFFERSIZE);///////////////////////////////////////////////////////////
    }
    
    
//usart2   
    if (huart->Instance == USART2_UX)                    /* 如果是串口2 */
    {

        if ((g_usart_rx_sta2 & 0x8000) == 0)             /* 接收未完成 */
        {
            if (g_usart_rx_sta2 & 0x4000)                /* 接收到了0x0d（即回车键） */
            {
                if (g_rx_buffer2[0] != 0x0a)             /* 接收到的不是0x0a（即不是换行键） */
                {
                    g_usart_rx_sta2 = 0;                 /* 接收错误,重新开始 */
                }
                else                                    /* 接收到的是0x0a（即换行键） */
                {
                    g_usart_rx_sta2 |= 0x8000;           /* 接收完成了 */
                }
            }
            else                                        /* 还没收到0X0d（即回车键） */
            {
                if (g_rx_buffer2[0] == 0x0d)
                    g_usart_rx_sta2 |= 0x4000;
                else
                {
                    g_usart_rx_buf2[g_usart_rx_sta2 & 0X3FFF] = g_rx_buffer2[0];
                    g_usart_rx_sta2++;

                    if (g_usart_rx_sta2 > (USART2_REC_LEN - 1))
                    {
                        g_usart_rx_sta2 = 0;             /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }

        HAL_UART_Receive_IT(&g_uart2_handle, (uint8_t *)g_rx_buffer2, RXBUFFERSIZE_2);////////////////////////////////////////////////////

    }
    
    
//usart3
    if (huart->Instance == USART3_UX)                    /* 如果是串口2 */
    {
        if ((g_usart_rx_sta3 & 0x8000) == 0)             /* 接收未完成 */
        {
            if (g_usart_rx_sta3 & 0x4000)                /* 接收到了0x0d（即回车键） */
            {
                if (g_rx_buffer3[0] != 0x0a)             /* 接收到的不是0x0a（即不是换行键） */
                {
                    g_usart_rx_sta3 = 0;                 /* 接收错误,重新开始 */
                }
                else                                    /* 接收到的是0x0a（即换行键） */
                {
                    g_usart_rx_sta3 |= 0x8000;           /* 接收完成了 */
                }
            }
            else                                        /* 还没收到0X0d（即回车键） */
            {
                if (g_rx_buffer3[0] == 0x0d)
                    g_usart_rx_sta3 |= 0x4000;
                else
                {
                    g_usart_rx_buf3[g_usart_rx_sta3 & 0X3FFF] = g_rx_buffer3[0];
                    g_usart_rx_sta3++;

                    if (g_usart_rx_sta3 > (USART3_REC_LEN - 1))
                    {
                        g_usart_rx_sta3 = 0;             /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }

        HAL_UART_Receive_IT(&g_uart3_handle, (uint8_t *)g_rx_buffer3, RXBUFFERSIZE_3);//////////////////////////////////////////////
    }    
    
}






//*****************************************************************************
void USART_UX_IRQHandler(void)
{

    HAL_UART_IRQHandler(&g_uart1_handle);   /* 调用HAL库中断处理公用函数 */
    //printf("%s",g_rx_buffer);

}

/**
 * @brief       串口2中断服务函数
 * @param       无
 * @retval      无
 */
void USART2_UX_IRQHandler(void)
{
//    BaseType_t xHigherPriorityTaskWoken = pdFALSE; // 初始值为 pdFALSE
    HAL_UART_IRQHandler(&g_uart2_handle);   /* 调用HAL库中断处理公用函数 */
//    printf("%s",g_rx_buffer2);
//    xQueueOverwriteFromISR(xQueueIRQcmd, &g_rx_buffer2, &xHigherPriorityTaskWoken);
//    // 在退出中断服务函数时，检查是否需要唤醒更高优先级的任务
//    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}


/**
 * @brief       串口3中断服务函数
 * @param       无
 * @retval      无
 */
void USART3_UX_IRQHandler(void)
{
    HAL_UART_IRQHandler(&g_uart3_handle);   /* 调用HAL库中断处理公用函数 */
    //printf("%s",g_rx_buffer3);
}
//*****************************************************************************

/**
 * @brief       串口X初始化函数
 * @param       baudrate: 波特率, 根据自己需要设置波特率值
 * @note        注意: 必须设置正确的时钟源, 否则串口波特率就会设置异常.
 *              这里的USART的时钟源在sys_stm32_clock_init()函数中已经设置过了.
 * @retval      无
 */
void usart_init(uint32_t baudrate,uint32_t baudrate2,uint32_t baudrate3)
{
    ///////////////////////////////////////////////////////////////////////////////////////////////////////
    /*UART1 初始化设置*/
    g_uart1_handle.Instance = USART_UX;                                       /* USART_UX */
    g_uart1_handle.Init.BaudRate = baudrate;                                  /* 波特率 */
    g_uart1_handle.Init.WordLength = UART_WORDLENGTH_8B;                      /* 字长为8位数据格式 */
    g_uart1_handle.Init.StopBits = UART_STOPBITS_1;                           /* 一个停止位 */
    g_uart1_handle.Init.Parity = UART_PARITY_NONE;                            /* 无奇偶校验位 */
    g_uart1_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;                      /* 无硬件流控 */
    g_uart1_handle.Init.Mode = UART_MODE_TX_RX;                               /* 收发模式 */
    HAL_UART_Init(&g_uart1_handle);                                           /* HAL_UART_Init()会使能UART1 */

    /* 该函数会开启接收中断：标志位UART_IT_RXNE，并且设置接收缓冲以及接收缓冲接收最大数据量 */
    HAL_UART_Receive_IT(&g_uart1_handle, (uint8_t *)g_rx_buffer, RXBUFFERSIZE); 
    
    ///////////////////////////////////////////////////////////////////////////////////////////////////////    
    //usart2
    /*UART 初始化设置*/
    g_uart2_handle.Instance = USART2_UX;                                       /* USART_UX */
    g_uart2_handle.Init.BaudRate = baudrate2;                                  /* 波特率 */
    g_uart2_handle.Init.WordLength = UART_WORDLENGTH_8B;                      /* 字长为8位数据格式 */
    g_uart2_handle.Init.StopBits = UART_STOPBITS_1;                           /* 一个停止位 */
    g_uart2_handle.Init.Parity = UART_PARITY_NONE;                            /* 无奇偶校验位 */
    g_uart2_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;                      /* 无硬件流控 */
    g_uart2_handle.Init.Mode = UART_MODE_TX_RX;                               /* 收发模式 */
    HAL_UART_Init(&g_uart2_handle);                                           /* HAL_UART_Init()会使能UART1 */

    /* 该函数会开启接收中断：标志位UART_IT_RXNE，并且设置接收缓冲以及接收缓冲接收最大数据量 */
    HAL_UART_Receive_IT(&g_uart2_handle, (uint8_t *)g_rx_buffer2, RXBUFFERSIZE_2); 
    
    ///////////////////////////////////////////////////////////////////////////////////////////////////////
    //usart3
    /*UART 初始化设置*/
    g_uart3_handle.Instance = USART3_UX;                                       /* USART_UX */
    g_uart3_handle.Init.BaudRate = baudrate3;                                  /* 波特率 */
    g_uart3_handle.Init.WordLength = UART_WORDLENGTH_8B;                      /* 字长为8位数据格式 */
    g_uart3_handle.Init.StopBits = UART_STOPBITS_1;                           /* 一个停止位 */
    g_uart3_handle.Init.Parity = UART_PARITY_NONE;                            /* 无奇偶校验位 */
    g_uart3_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;                      /* 无硬件流控 */
    g_uart3_handle.Init.Mode = UART_MODE_TX_RX;                               /* 收发模式 */
    HAL_UART_Init(&g_uart3_handle);                                           /* HAL_UART_Init()会使能UART1 */

    /* 该函数会开启接收中断：标志位UART_IT_RXNE，并且设置接收缓冲以及接收缓冲接收最大数据量 */
    HAL_UART_Receive_IT(&g_uart3_handle, (uint8_t *)g_rx_buffer3, RXBUFFERSIZE_3); 
    ///////////////////////////////////////////////////////////////////////////////////////////////////////
    
}





/**
 * @brief       UART底层初始化函数
 * @param       huart: UART句柄类型指针
 * @note        此函数会被HAL_UART_Init()调用
 *              完成时钟使能，引脚配置，中断配置
 * @retval      无
 */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    GPIO_InitTypeDef gpio_init_struct;
    
    
//usart1/////////////////////////////////////////////////////////
    if (huart->Instance == USART_UX)                            /* 如果是串口1，进行串口1 MSP初始化 */
    {
        USART_TX_GPIO_CLK_ENABLE();                             /* 使能串口TX脚时钟 */
        USART_RX_GPIO_CLK_ENABLE();                             /* 使能串口RX脚时钟 */
        USART_UX_CLK_ENABLE();                                  /* 使能串口时钟 */

        gpio_init_struct.Pin = USART_TX_GPIO_PIN;               /* 串口发送引脚号 */
        gpio_init_struct.Mode = GPIO_MODE_AF_PP;                /* 复用推挽输出 */
        gpio_init_struct.Pull = GPIO_PULLUP;                    /* 上拉 */
        gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH;          /* IO速度设置为高速 */
        HAL_GPIO_Init(USART_TX_GPIO_PORT, &gpio_init_struct);
                
        gpio_init_struct.Pin = USART_RX_GPIO_PIN;               /* 串口RX脚 模式设置 */
        gpio_init_struct.Mode = GPIO_MODE_INPUT;//GPIO_MODE_AF_INPUT;    
        HAL_GPIO_Init(USART_RX_GPIO_PORT, &gpio_init_struct);   /* 串口RX脚 必须设置成输入模式 */
        
#if USART_EN_RX
        HAL_NVIC_EnableIRQ(USART_UX_IRQn);                      /* 使能USART1中断通道 */
        HAL_NVIC_SetPriority(USART_UX_IRQn, 3, 3);              /* 组2，最低优先级:抢占优先级3，子优先级3 */
#endif
    }
    
    
//usart2/////////////////////////////////////////////////////////        
    if (huart->Instance == USART2_UX)                            /* 如果是串口2，进行串口2 MSP初始化 */
    {
        USART2_TX_GPIO_CLK_ENABLE();                             /* 使能串口TX脚时钟 */
        USART2_RX_GPIO_CLK_ENABLE();                             /* 使能串口RX脚时钟 */
        USART2_UX_CLK_ENABLE();                                  /* 使能串口时钟 */

        gpio_init_struct.Pin = USART2_TX_GPIO_PIN;               /* 串口发送引脚号 */
        gpio_init_struct.Mode = GPIO_MODE_AF_PP;                /* 复用推挽输出 */
        gpio_init_struct.Pull = GPIO_PULLUP;                    /* 上拉 */
        gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH;          /* IO速度设置为高速 */
        HAL_GPIO_Init(USART2_TX_GPIO_PORT, &gpio_init_struct);
                
        gpio_init_struct.Pin = USART2_RX_GPIO_PIN;               /* 串口RX脚 模式设置 */
        gpio_init_struct.Mode = GPIO_MODE_INPUT;//GPIO_MODE_AF_INPUT;    
        HAL_GPIO_Init(USART2_RX_GPIO_PORT, &gpio_init_struct);   /* 串口RX脚 必须设置成输入模式 */
        
#if USART2_EN_RX
        HAL_NVIC_EnableIRQ(USART2_UX_IRQn);                      /* 使能USART2中断通道 */
        HAL_NVIC_SetPriority(USART2_UX_IRQn, 2, 3);              /* 组2，最低优先级:抢占优先级3，子优先级3 */
#endif
    }
    
    
    
//usart3//////////////////////////////////////////////////////////        
    if (huart->Instance == USART3_UX)                            /* 如果是串口2，进行串口2 MSP初始化 */
    {
        USART3_TX_GPIO_CLK_ENABLE();                             /* 使能串口TX脚时钟 */
        USART3_RX_GPIO_CLK_ENABLE();                             /* 使能串口RX脚时钟 */
        USART3_UX_CLK_ENABLE();                                  /* 使能串口时钟 */

        gpio_init_struct.Pin = USART3_TX_GPIO_PIN;               /* 串口发送引脚号 */
        gpio_init_struct.Mode = GPIO_MODE_AF_PP;                /* 复用推挽输出 */
        gpio_init_struct.Pull = GPIO_PULLUP;                    /* 上拉 */
        gpio_init_struct.Speed = GPIO_SPEED_FREQ_HIGH;          /* IO速度设置为高速 */
        HAL_GPIO_Init(USART3_TX_GPIO_PORT, &gpio_init_struct);
                
        gpio_init_struct.Pin = USART3_RX_GPIO_PIN;               /* 串口RX脚 模式设置 */
        gpio_init_struct.Mode = GPIO_MODE_INPUT;//GPIO_MODE_AF_INPUT;    
        HAL_GPIO_Init(USART3_RX_GPIO_PORT, &gpio_init_struct);   /* 串口RX脚 必须设置成输入模式 */
        
#if USART3_EN_RX
        HAL_NVIC_EnableIRQ(USART3_UX_IRQn);                      /* 使能USART2中断通道 */
        HAL_NVIC_SetPriority(USART3_UX_IRQn, 2, 2);              /* 组2，最低优先级:抢占优先级3，子优先级3 */
#endif
    }
    
    
}


void sendDecimalToHex(char *decimalString) {
    int num1, num2, num3;

    // 使用 sscanf 将字符串解析为整数
    sscanf(decimalString, "%d %d %d", &num1, &num2, &num3);

    // 使用 sprintf 将整数格式化为十六进制字符串
    uint8_t hexString[3]={num1,num2,num3};  // 根据实际情况调整数组大小

    // 使用 HAL_UART_Transmit 发送数据
    HAL_UART_Transmit(&g_uart3_handle, (uint8_t *)hexString, 3, HAL_MAX_DELAY);
    //HAL_UART_Transmit(&g_uart3_handle, (uint8_t *)hexString, 3, HAL_MAX_DELAY);

}



void SendFormattedData(double value) {
    // 将 double 拆分成整数部分和小数部分
    int integralPart = (int)value;
       // 计算浮点数减去整数部分后的小数部分
    float decimalPart = value - integralPart;

    // 将小数部分保留三位小数
    decimalPart = (float)((int)(decimalPart * 1000)) / 1000.0f;

    // 转换为整数
    int fractionalPart = (int)(decimalPart * 1000);
    // 发送整数部分
    uint8_t dataBufferInt[5] = {0x03, (uint8_t)integralPart ,(uint8_t)(integralPart >> 24),(uint8_t)(integralPart >> 16),(uint8_t)(integralPart >> 8)};
    HAL_UART_Transmit(&g_uart3_handle, dataBufferInt, sizeof(dataBufferInt), HAL_MAX_DELAY);
    //HAL_UART_Transmit(&g_uart3_handle, dataBufferInt, sizeof(dataBufferInt), HAL_MAX_DELAY);
    //delay_ms(100);
    // 发送小数部分
    uint8_t dataBufferFrac[5] = {0x05,(uint8_t)(fractionalPart%256),(uint8_t)(fractionalPart/256), 0,0};
    HAL_UART_Transmit(&g_uart3_handle, dataBufferFrac, sizeof(dataBufferFrac), HAL_MAX_DELAY);
    //HAL_UART_Transmit(&g_uart3_handle, dataBufferFrac, sizeof(dataBufferFrac), HAL_MAX_DELAY);
}
